Arycast/pulp-runtime/arduino/boards.txt
# Copyright (C) 2026 Indonesia Chip Design Collaborative Center (ICDEC)
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
# EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
# OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
# NONINFRINGEMENT.

softpulpissimopynqz1.name=Soft-Pulpissimo PYNQ-Z1
softpulpissimopynqz1.build.mcu=riscv
softpulpissimopynqz1.build.board=SOFT_PULPISSIMO_PYNQ_Z1
#softpulpissimopynqz1.build.core=
softpulpissimopynqz1.build.variant=soft-pulpissimo_pynq-z1
softpulpissimopynqz1.programmer.default=openocd_jlink
softpulpissimopynqz1.upload.tool.default=openocd_jlink
softpulpissimopynqz1.program.tool.default=openocd_jlink
#softpulpissimopynqz1.erase.tool.default=
#softpulpissimopynqz1.bootloader.tool.default=
softpulpissimopynqz1.openocd_target_cfg=soft_pynq-z1.cfg
